БухЭксп/InformationRegisters/CW_СоответствиеОрганизацийКонтрагентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоответствиеОрганизацийКонтрагентам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоответствиеОрганизацийКонтрагентам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - Контрагент входит в холдинг
//
//	Определяет входит-ли переданный контрагент в холдинг
//
// Возвращаемое значение:
//   - Истина/Ложь
//
Функция КонтрагентВходитВХолдинг(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоответствиеОрганизацийКонтрагентам.Организация КАК Организация
	               |ИЗ
	               |	РегистрСведений.CW_СоответствиеОрганизацийКонтрагентам КАК CW_СоответствиеОрганизацийКонтрагентам
	               |ГДЕ
	               |	CW_СоответствиеОрганизацийКонтрагентам.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();	
	
КонецФункции

Функция ПолучитьКонтрагентаОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоответствиеОрганизацийКонтрагентам.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.CW_СоответствиеОрганизацийКонтрагентам КАК CW_СоответствиеОрганизацийКонтрагентам
	               |ГДЕ
	               |	CW_СоответствиеОрганизацийКонтрагентам.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Контрагент;
	КонецЕсли;
	
КонецФункции


#КонецЕсли
